/**
 * ares.constants.js
 *
 * Ares 常量组件
 *  用于配置一些常量信息，如服务器请求地址等
 *
 * $ -- jQuery
 * c -- 模块配置文件，用于配置模块需要的参数信息  {components/_c/c.js} 需要的配置必须放在 Constants 节点
 *
 * 常用配置说明
 *
 *  Api: 服务接口
 *  Modules: 模块配置信息
 *
 */

var $ = require('jquery');
var Constants = {
    'Api': {},

    'Modules': {},

    'occupation': {
        "1A": "各类专业、技术人员",
        "1B": "国家机关、党群组织、企事业单位的负责人",
        "1C": "办事人员和有关人员",
        "1D": "商业工作人员",
        "1E": "服务性工作人员",
        "1F": "农林牧渔劳动者",
        "1G": "生产工作、运输工作和部分体力劳动者",
        "1H": "不便分类的其他劳动者",
        "1I": "军人",
        "2A": "农、林、牧、渔业",
        "2B": "采矿业",
        "2C": "制造业",
        "2D": "电力、燃气及水的生产和供应业",
        "2E": "建筑业",
        "2F": "交通运输、仓储和邮政业",
        "2G": "信息传输、计算机服务和软件业",
        "2H": "批发和零售业",
        "2I": "住宿和餐饮业",
        "2J": "银行业",
        "2K": "房地产业",
        "2L": "租赁和商务服务业",
        "2M": "科学研究、技术服务和地质勘查业",
        "2N": "水利、环境和公共设施管理业",
        "2O": "居民服务和其他服务业",
        "2P": "教育",
        "2Q": "卫生、社会保障和社会福利业",
        "2R": "卫生、体育和娱乐业",
        "2S": "公共管理和社会组织",
        "2T": "国际组织"
    }
};

module.exports = Constants;